ACR/src/temp/test.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ns="http://rail-russia.test/ws/SoapApi/0.1/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns:acr_JourneySearch>
            <access>
                <resellerCode>and-prt-ua</resellerCode>
                <userName>andrew</userName>
                <password>1234</password>
                <lang>ru</lang>
            </access>
            <originDestinationSearch>
                <originCode>MOW</originCode>
                <originDate>2015-09-03</originDate>
                <originTimeFrom>00:00</originTimeFrom>
                <originTimeTo>24:00</originTimeTo>
                <destinationCode>LED</destinationCode>
            </originDestinationSearch>
            <passengers>
                <passenger>
                    <birthDate>1980-03-12</birthDate>
                </passenger>
                <passenger>
                    <birthDate>1982-03-12</birthDate>
                </passenger>
            </passengers>
        </ns:acr_JourneySearch>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>